Channel Flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2425;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       2525;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       2550;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       2575;
    }
)

// ************************************************************************* //
